embarquech/cryptnox-pos/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"

# Enough stack for TLS + JSON + crypto operations in app_main
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# mbedTLS certificate bundle for HTTPS RPC endpoints
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# HTTPS support in the HTTP client
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y

# CYD ships with a Boya SPI flash chip — link its dedicated driver so IDF
# doesn't fall back to the generic one (silences the boot-time warning)
CONFIG_SPI_FLASH_SUPPORT_BOYA_CHIP=y

# CYD has 4 MB flash — custom 3 MB app partition
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=n
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_PARTITION_TABLE_SINGLE_APP=n
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Arduino-as-component — auto-start setup()/loop() is NOT used; we call from app_main
CONFIG_AUTOSTART_ARDUINO=n
CONFIG_FREERTOS_HZ=1000

# TFT_eSPI config for CYD ESP32-2432S028R (mirrors esp32-loot's platformio build_flags)
CONFIG_TFT_ILI9341_DRIVER=n
CONFIG_TFT_ILI9341_2_DRIVER=y
CONFIG_TFT_BGR_ORDER=y
CONFIG_TFT_WIDTH=240
CONFIG_TFT_HEIGHT=320
CONFIG_TFT_HSPI_PORT=y
CONFIG_TFT_MISO=12
CONFIG_TFT_MOSI=13
CONFIG_TFT_SCLK=14
CONFIG_TFT_CS=15
CONFIG_TFT_DC=2
# CYD: the panel RESET is hard-wired to the board EN line — no GPIO controls it.
# TFT_eSPI emits "Invalid Reset pin" at build time: expected, the driver falls
# back to software reset (SWRESET).
CONFIG_TFT_RST=-1
CONFIG_ENABLE_BL=y
CONFIG_TFT_BL=21
CONFIG_TFT_BACKLIGHT_ON_HIGH=y
CONFIG_TFT_SPI_FREQUENCY=55000000
CONFIG_TFT_LOAD_GLCD=y
CONFIG_TFT_LOAD_FONT2=y
CONFIG_TFT_LOAD_FONT4=y
CONFIG_TFT_LOAD_FONT6=y
CONFIG_TFT_LOAD_GFXFF=y
CONFIG_TFT_SMOOTH_FONT=y

# ── LVGL (8.x) — UI toolkit, configured here for a reproducible build ──
# TFT_eSPI is used only as the low-level panel driver (flush); LVGL renders.
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_MEM_SIZE_KILOBYTES=48
# Anti-aliased Montserrat font sizes referenced by ui.cpp
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y

# CYD: the XPT2046 touch controller lives on its own SPI bus (CS=33, CLK=25,
# MOSI=32, MISO=39, IRQ=36), driven by the XPT2046_Touchscreen component — NOT
# by TFT_eSPI, whose touch support requires sharing the display bus. The
# build-time "TOUCH_CS pin not defined" warning is expected; do not enable
# CONFIG_ENABLE_TOUCH, it would fight the XPT2046 driver over GPIO 33.
